# 3. Написать функцию, аргументы имена сотрудников, возвращает словарь, ключи 
# — первые буквы имён, значения — списки, содержащие имена, начинающиеся с соответствующей буквы.
# in
# "Иван", "Мария", "Петр", "Илья", "Марина", "Петр", "Алина", "Бибочка"
# out
# {'А': ['Алина'], 'Б': ['Бибочка'], 'И': ['Иван', 'Илья'], 'М': ['Марина', 'Мария'],
#  'П': ['Петр', 'Петр']}
list = ["Иван", "Мария", "Петр", "Илья", "Марина", "Петр", "Алина", "Бибочка"]
list_sort = sorted(list)
print("Исхоный список имен:")
print(list)
def create_dict(list_sort):
   dict_name = {}
   for name in list_sort:
      key = name[0]
      if key not in dict_name:
         dict_name[key] = []
      dict_name[key].append(name)
   return dict_name
print("Словарь:")
print(create_dict(list_sort))

     
